In [32]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

from city import City

In [24]:
data = pd.read_excel('worldcities.xlsx', engine='openpyxl')
data.head()

,city,city_ascii,lat,lng,country,iso2,iso3,admin_name,capital,population,id
0,Tokyo,Tokyo,35.6897,139.6922,Japan,JP,JPN,Tōkyō,primary,37977000.0,1392685764
1,Jakarta,Jakarta,-6.2146,106.8451,Indonesia,ID,IDN,Jakarta,primary,34540000.0,1360771077
2,Delhi,Delhi,28.6600,77.2300,India,IN,IND,Delhi,admin,29617000.0,1356872604
3,Mumbai,Mumbai,18.9667,72.8333,India,IN,IND,Mahārāshtra,admin,23355000.0,1356226629
4,Manila,Manila,14.5958,120.9772,Philippines,PH,PHL,Manila,primary,23088000.0,1608618140

In [25]:
data.count()

city          26569
city_ascii    26569
lat           26569
lng           26569
country       26569
iso2          26538
iso3          26569
admin_name    26493
capital        7626
population    25596
id            26569
dtype: int64

In [26]:
data['country'].unique().size

224

In [27]:
sorted_data = data.sort_values(by='lng')
sorted_data.tail()

,city,city_ascii,lat,lng,country,iso2,iso3,admin_name,capital,population,id
796,Suva,Suva,-18.1333,178.4333,Fiji,FJ,FJI,Rewa,primary,88271.0,1242615095
5581,Nausori,Nausori,-18.0244,178.5454,Fiji,FJ,FJI,Tailevu,NaN,47604.0,1242640119
820,Funafuti,Funafuti,-8.5167,179.2167,Tuvalu,TV,TUV,Funafuti,primary,6025.0,1798251391
26390,Beringovskiy,Beringovskiy,63.0655,179.3067,Russia,RU,RUS,Chukotskiy Avtonomnyy Okrug,NaN,1861.0,1643017874
13224,Labasa,Labasa,-16.4333,179.3667,Fiji,FJ,FJI,Macuata,NaN,27949.0,1242740801

In [44]:
# Tokyo
source_city_row = data[data['id']==1392685764]
cource_city = City(source_city_row['city_ascii'].iloc[0], source_city_row['lat'].iloc[0],
                   source_city_row['lng'].iloc[0], source_city_row['country'].iloc[0],
                   source_city_row['population'].iloc[0], source_city_row['id'].iloc[0])

# Jakarta
dest_city_row = data[data['id']==1360771077]
dest_city = City(dest_city_row['city_ascii'].iloc[0], dest_city_row['lat'].iloc[0],
                 dest_city_row['lng'].iloc[0], dest_city_row['country'].iloc[0],
                 dest_city_row['population'].iloc[0], dest_city_row['id'].iloc[0])

cource_city.calculate_distance(dest_city)

53.243800924614696

In [29]:
# def calc_distance(dest_city_id, source_city_id, df=data):
#     '''
#     dest_city_id: int, 
#     source_city_id: int
#     Calculates Euclidian distance between two cities
#     '''
#     # TODO think about distance between [-150, 150] by longitude
#     # TODO calculate by id, not city name
#     source_city_row = df[df['id']==source_city_id]
#     x1, y1 = source_city_row['lat'].iloc[0], source_city_row['lng'].iloc[0]
#     dest_city_row = df[df['id']==dest_city_id]
#     x2, y2 = dest_city_row['lat'].iloc[0], dest_city_row['lng'].iloc[0]

#     return np.sqrt((x2-x1) ** 2 + (y2-y1) ** 2)
    
# calc_distance(1392685764, 1360771077)

53.243800924614696

In [18]:
def find_three_closest(cur_city, df=data, only_east=False):
    '''
    Returns three closest cities to the chosen one.
    if only_east is true, returns only three closest cities to the east from given
    '''
    # TODO only_east
    if only_east:
#         df[df['lng'] > ]
        pass
    else:
        df['Distances'] = df['id'].apply(lambda dest: calc_distance(dest, cur_city))
    return df.sort_values(by='Distances').iloc[1:4]
    
# my_df = find_three_closest('Lviv')

In [19]:
# London
my_df = find_three_closest(1826645935)
my_df

,city,city_ascii,lat,lng,country,iso2,iso3,admin_name,capital,population,id,Distances
6681,Holborn,Holborn,51.5172,-0.1182,United Kingdom,GB,GBR,Camden,NaN,13023.0,1826657058,0.013656
7432,Lambeth,Lambeth,51.4903,-0.1193,United Kingdom,GB,GBR,Lambeth,NaN,9675.0,1826545364,0.018784
2535,Islington,Islington,51.5440,-0.1027,United Kingdom,GB,GBR,Islington,NaN,206125.0,1826267810,0.044377

In [20]:
data[data['id']==1826657058]['country'].iloc[0]

'United Kingdom'

In [21]:
def calc_travel_time(dest_city_id, source_city_id, n_closest=1, df=data):
    '''
    n_closest: int, 1 is the closest city, 2 - second closest, etc.
    Returns travel time between the cities
    '''
    result_time = 2 ** n_closest
    if df[df['id']==source_city_id]['country'].iloc[0] != df[df['id']==dest_city_id]['country'].iloc[0]:
        result_time += 2
    if df[df['id']==dest_city_id]['population'].iloc[0] > 200000:
        result_time +=2
    return result_time

calc_travel_time(1826657058, 1826645935, 1)

2

In [22]:
print(calc_travel_time(1826657058, 1826645935, 1))
print(calc_travel_time(1826545364, 1826645935, 2))
print(calc_travel_time(1826267810, 1826645935, 3))

2
4
10